# yolo_mim.yaml - Config for Self-Supervised Pre-training
nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 (Standard)
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
  # CHANGE HERE: Input args must match the backbone output (256 for Nano)
  # But wait, looking at your log, Layer 8 (C2f) output 256 channels.
  # This implies standard YOLOv8n. Let's align explicitly with your log:

  - [-1, 1, MIMAdapter, [256]] # 10 - Changed from 1024 to 256
  - [-1, 1, MIMHead, [256]]    # 11 - Changed from 1024 to 256